tap "eugenmayer/dockersync"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kayac/tap"
brew "mas"

# GNU Utils
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "moreutils"

# Build utils
brew "automake"
brew "pkg-config"
brew "readline"
brew "gcc"
brew "openssl@3"
brew "libtool"
brew "libyaml"
brew "unixodbc"
brew "gnupg"
brew "lbzip2"
brew "libxslt"
brew "llvm"
brew "lzlib"
brew "bzip2"
brew "unzip"
brew "zlib"

# Dev tools
brew "asdf"
brew "awscli"
brew "awslogs"
brew "curl"
brew "direnv"
brew "gh"
brew "git"
brew "jq"
brew "mysql" # for installing client libs
brew "postgresql" # for installing client libs
brew "thefuck"
brew "tig"
brew "zsh"
brew "zsh-completions"
brew "kayac/tap/ecspresso"
cask "ngrok"
cask "fig"
brew "gitmoji"
brew "gitui"
brew "tree"
brew "bat"
brew "htop"
brew "httpie"
brew "tre-command"

# docker
brew "unison"
brew "eugenmayer/dockersync/unox"

## Desktop apps
cask "visual-studio-code"
cask "docker"
cask "google-japanese-ime"
cask "iterm2", args: { appdir: "~/Applications" }
cask "slack", args: { appdir: "~/Applications" }

# Browsers
cask "google-chrome"
cask "firefox"
cask "brave-browser"
