tap 'eugenmayer/dockersync'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'kayac/tap'
brew 'mas'

# GNU Utils
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'moreutils'

# Build utils
brew 'automake'
brew 'pkg-config'
brew 'readline'
brew 'gcc'
brew 'openssl@3'
brew 'libtool'
brew 'libyaml'
brew 'unixodbc'
brew 'gnupg'
brew 'lbzip2'
brew 'libxslt'
brew 'llvm'
brew 'lzlib'
brew 'bzip2'
brew 'unzip'
brew 'zlib'

# Dev tools
brew 'asdf'
brew 'awscli'
brew 'awslogs'
brew 'curl'
brew 'direnv'
brew 'gh' # GitHub CLI
brew 'ghq'
brew 'git'
brew 'jq'
brew 'mysql' # for installing client libs
brew 'postgresql' # for installing client libs
brew 'thefuck'
brew 'tig'
brew 'zsh'
brew 'zsh-completions'
brew 'kayac/tap/ecspresso'
cask 'ngrok'
cask 'fig' # CLI autocomplete
brew 'gitmoji' # emoji for commit messages
brew 'gitui'
brew 'tree' # for tree command
brew 'bat' # instead of cat
brew 'htop' # instead of top
brew 'httpie' # instead of curl
brew 'tre-command' # instead of tree
brew 'peco' # pager
brew 'ripgrep' # instead of grep
brew 'zoxide' # cd on steroids
brew 'fzf' # fuzzy finder
brew 'git-delta' # git diff on steroids
brew 'fd' # instead of find

# docker
brew 'unison'
brew 'eugenmayer/dockersync/unox'

## Desktop apps
cask 'visual-studio-code'
cask 'docker'
cask 'google-japanese-ime'
cask 'iterm2', args: { appdir: '~/Applications' }
cask 'slack', args: { appdir: '~/Applications' }

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'brave-browser'
