tap 'eugenmayer/dockersync'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'kayac/tap'
brew 'mas'
brew 'duti'

# GNU Utils
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'moreutils'

# Build utils
brew 'automake'
brew 'pkg-config'
brew 'readline'
brew 'gcc'
brew 'openssl@3'
brew 'libtool'
brew 'libyaml'
brew 'unixodbc'
brew 'gnupg'
brew 'lbzip2'
brew 'libxslt'
brew 'llvm'
brew 'lzlib'
brew 'bzip2'
brew 'unzip'
brew 'zlib'

# Dev tools
brew 'mise'
brew 'awscli'
brew 'awslogs'
brew 'curl'
brew 'direnv'
brew 'gh' # GitHub CLI
brew 'ghq'
brew 'git'
brew 'jq'
brew 'yq'
brew 'mysql-client' # client libs only (was 'mysql' — a full server)
brew 'libpq' # postgres client libs only (was 'postgresql' — a full server)
brew 'pay-respects' # `f` to fix the last command (Rust; replaced slow Python 'thefuck')
brew 'tig'
brew 'zsh'
brew 'zsh-completions'
brew 'kayac/tap/ecspresso'
cask 'ngrok'
# 'fig' removed — Fig was acquired by AWS and discontinued (now Amazon Q CLI).
brew 'gitmoji' # emoji for commit messages
brew 'lazydocker' # docker TUI (pairs with lazygit + d/dc aliases)
# 'gitui' removed — redundant with tig (log browsing) + lazygit (operations).
brew 'tree' # for tree command
brew 'bat' # instead of cat
brew 'htop' # instead of top
brew 'httpie' # instead of curl
brew 'tre-command' # instead of tree
brew 'peco' # pager
brew 'ripgrep' # instead of grep
brew 'zoxide' # cd on steroids
brew 'fzf' # fuzzy finder
brew 'git-delta' # git diff on steroids
brew 'fd' # instead of find
brew 'dust' # instead of du
brew 'duf' # instead of df
brew 'prettyping' # instead of ping
brew 'procs' # instead of ps
brew 'eza' # instead of ls
brew 'wget'
brew 'atuin' # searchable shell history (replaces Ctrl-R)
brew 'yazi' # terminal file manager (Rust)
brew 'difftastic' # syntax-aware structural diff
brew 'zellij' # terminal multiplexer (try locally: `make zellij` then `zellij`)

# docker
brew 'unison'
brew 'eugenmayer/dockersync/unox'

## Desktop apps
cask 'visual-studio-code', args: { appdir: '~/Applications' }
cask 'docker'
cask 'google-japanese-ime'
cask 'iterm2', args: { appdir: '~/Applications' }
cask 'google-drive'
cask 'alfred', args: { appdir: '~/Applications' }
cask 'figma', args: { appdir: '~/Applications' }
# 'graphql-playground' removed — project discontinued (use Postman/Insomnia/Apollo).
cask 'postman', args: { appdir: '~/Applications' }
cask 'zoom', args: { appdir: '~/Applications' }
cask 'discord', args: { appdir: '~/Applications' }
cask 'notion', args: { appdir: '~/Applications' }

# Browsers
cask 'google-chrome', args: { appdir: '~/Applications' }
cask 'chromium', args: { appdir: '~/Applications' }
cask 'firefox', args: { appdir: '~/Applications' }
cask 'brave-browser', args: { appdir: '~/Applications' }

cask 'flux', args: { appdir: '~/Applications' }

mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'CopyClip', id: 595191960
mas 'Telegram', id: 747648890
mas 'LINE', id: 539883307
mas 'Prime Video', id: 545519333 # Amazon Music
